keroro1768/M487_ScsiTool/firmware/composite/hid_i2c.c
    HID_InitForHighSpeed();

    /* MSC init */
    g_sCSW.dCSWSignature = CSW_SIGNATURE;
    g_TotalSectors = 60;  /* 60 sectors x 512 = 30KB RAM disk */
    g_u32MassBase = 0x20001000;
    g_u32StorageBase = 0x20002000;
}

/*---------------------------------------------------------------------------------------------------------*/
/* USB Class Request Handler                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
void HID_ClassRequest(void)
{
    if (gUsbCmd.bmRequestType & 0x80) {
        switch (gUsbCmd.bRequest) {
        case GET_MAX_LUN:
            g_u8MscStart = 1;
            HSUSBD_PrepareCtrlIn((uint8_t *)&g_u32MSCMaxLun, 1);
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
            break;
        case GET_REPORT:
        case GET_IDLE:
        case GET_PROTOCOL:
        default:
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
            break;
        }
    } else {
        switch (gUsbCmd.bRequest) {
        case BULK_ONLY_MASS_STORAGE_RESET:
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            break;
        case SET_REPORT:
            if (((gUsbCmd.wValue >> 8) & 0xff) == 3) {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }
            break;
        case SET_IDLE:
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            break;
        case SET_PROTOCOL:
        default:
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
            break;
        }
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* Vendor Request Handler                                                                                  */
/*---------------------------------------------------------------------------------------------------------*/
void HID_VendorRequest(void)
{
    /* No vendor-specific requests needed */
    HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Helper: convert big-endian uint32                                                                       */
/*---------------------------------------------------------------------------------------------------------*/
static uint32_t get_be32(uint8_t *p)
{
    return ((uint32_t)p[0] << 24) | ((uint32_t)p[1] << 16) | ((uint32_t)p[2] << 8) | p[3];
}

/*---------------------------------------------------------------------------------------------------------*/
/* MSC Command Handlers                                                                                   */
/*---------------------------------------------------------------------------------------------------------*/
void MSC_RequestSense(void)
{
    memset((uint8_t *)(g_u32MassBase), 0, 18);
    if (g_u8Prevent) {
        g_u8Prevent = 0;
        *(uint8_t *)(g_u32MassBase) = 0x70;
    } else {
        *(uint8_t *)(g_u32MassBase) = 0xf0;
    }
    *(uint8_t *)(g_u32MassBase + 2) = g_au8SenseKey[0];
    *(uint8_t *)(g_u32MassBase + 7) = 0x0a;
    *(uint8_t *)(g_u32MassBase + 12) = g_au8SenseKey[1];
    *(uint8_t *)(g_u32MassBase + 13) = g_au8SenseKey[2];
    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
    g_au8SenseKey[0] = g_au8SenseKey[1] = g_au8SenseKey[2] = 0;
}

void MSC_ReadCapacity(void)
{
    uint32_t tmp;
    memset((uint8_t *)g_u32MassBase, 0, 8);
    tmp = g_TotalSectors - 1;
    *((uint8_t *)(g_u32MassBase + 0)) = (tmp >> 24) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 1)) = (tmp >> 16) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 2)) = (tmp >> 8) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 3)) = tmp & 0xFF;
    *((uint8_t *)(g_u32MassBase + 6)) = 0x02;
    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_ReadFormatCapacity(void)
{
    memset((uint8_t *)g_u32MassBase, 0, 36);
    *((uint8_t *)(g_u32MassBase + 3)) = 0x10;
    *((uint8_t *)(g_u32MassBase + 4)) = (g_TotalSectors >> 24) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 5)) = (g_TotalSectors >> 16) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 6)) = (g_TotalSectors >> 8) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 7)) = g_TotalSectors & 0xFF;
    *((uint8_t *)(g_u32MassBase + 10)) = 0x02;
    *((uint8_t *)(g_u32MassBase + 12)) = (g_TotalSectors >> 24) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 13)) = (g_TotalSectors >> 16) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 14)) = (g_TotalSectors >> 8) & 0xFF;
    *((uint8_t *)(g_u32MassBase + 15)) = g_TotalSectors & 0xFF;
    *((uint8_t *)(g_u32MassBase + 18)) = 0x02;
    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_ModeSense10(void)
{
    uint8_t i, j, NumHead = 2, NumSector = 64;
    uint16_t NumCyl = g_TotalSectors / 128;
    *((uint32_t *)g_u32MassBase) = 0;
    *((uint32_t *)(g_u32MassBase + 4)) = 0;

    switch (g_sCBW.au8Data[0]) {
    case 0x01:
        *((uint8_t *)g_u32MassBase) = 19; i = 8;
        for (j = 0; j < 12; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_01[j];
        break;
    case 0x05:
        *((uint8_t *)g_u32MassBase) = 39; i = 8;
        for (j = 0; j < 32; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_05[j];
        *((uint8_t *)(g_u32MassBase + 12)) = NumHead;
        *((uint8_t *)(g_u32MassBase + 13)) = NumSector;
        *((uint8_t *)(g_u32MassBase + 16)) = (NumCyl >> 8) & 0xFF;
        *((uint8_t *)(g_u32MassBase + 17)) = NumCyl & 0xFF;
        break;
    case 0x1B:
        *((uint8_t *)g_u32MassBase) = 19; i = 8;
        for (j = 0; j < 12; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1B[j];
        break;
    case 0x1C:
        *((uint8_t *)g_u32MassBase) = 15; i = 8;
        for (j = 0; j < 8; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1C[j];
        break;
    case 0x3F:
        *((uint8_t *)g_u32MassBase) = 0x47; i = 8;
        for (j = 0; j < 12; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_01[j];
        for (j = 0; j < 32; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_05[j];
        for (j = 0; j < 12; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1B[j];
        for (j = 0; j < 8; j++, i++) *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1C[j];
        *((uint8_t *)(g_u32MassBase + 24)) = NumHead;
        *((uint8_t *)(g_u32MassBase + 25)) = NumSector;
        *((uint8_t *)(g_u32MassBase + 28)) = (NumCyl >> 8) & 0xFF;
        *((uint8_t *)(g_u32MassBase + 29)) = NumCyl & 0xFF;
        break;
    default:
        g_au8SenseKey[0] = 0x05; g_au8SenseKey[1] = 0x24; g_au8SenseKey[2] = 0x00;
    }
    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_ModeSense6(void)
{
    uint8_t i;
    for (i = 0; i < 4; i++)
        *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage[i];
    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_BulkOut(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop, i;
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);
    g_hsusbd_ShortPacket = 0;
    u32Loop = u32Len / USBD_MAX_DMA_LEN;
    for (i = 0; i < u32Loop; i++)
        MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, USBD_MAX_DMA_LEN);
    u32Loop = u32Len % USBD_MAX_DMA_LEN;
    if (u32Loop)
        MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, u32Loop);
}

void MSC_BulkIn(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop, i, addr, count;
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);
    u32Loop = u32Len / USBD_MAX_DMA_LEN;
    for (i = 0; i < u32Loop; i++) {
        HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_TXPKIEN_Msk);
        g_hsusbd_ShortPacket = 0;
        while (1)
            if (HSUSBD_GET_EP_INT_FLAG(EPC) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk) {
                MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, USBD_MAX_DMA_LEN);
                break;
            }
    }
    addr = u32Addr + i * USBD_MAX_DMA_LEN;
    u32Loop = u32Len % USBD_MAX_DMA_LEN;
    if (u32Loop) {
        count = u32Loop / g_u32EpMaxPacketSize;
        if (count) {
            HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_TXPKIEN_Msk);
            g_hsusbd_ShortPacket = 0;
            while (1)
                if (HSUSBD_GET_EP_INT_FLAG(EPC) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk) {
                    MSC_ActiveDMA(addr, count * g_u32EpMaxPacketSize);
                    break;
                }
            addr += (count * g_u32EpMaxPacketSize);
        }
        count = u32Loop % g_u32EpMaxPacketSize;
        if (count) {
            HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_TXPKIEN_Msk);
            g_hsusbd_ShortPacket = 1;
            while (1)
                if (HSUSBD_GET_EP_INT_FLAG(EPC) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk) {
                    MSC_ActiveDMA(addr, count);
                    break;
                }
        }
    }
}

void MSC_ReceiveCBW(uint32_t u32Buf)
{
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk |
                          HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR(u32Buf);
    HSUSBD_SET_DMA_LEN(31);
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();
}

void MSC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk |
                          HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(u32Len);
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();
    while (g_u8MscStart) {
        if (g_hsusbd_DmaDone) break;
        if (!HSUSBD_IS_ATTACHED()) break;
    }
}

