keroro1768/M487_ScsiTool/firmware/composite/hid_i2c.c
void MSC_AckCmd(uint32_t u32Residue)
{
    g_sCSW.dCSWDataResidue = u32Residue;
    g_sCSW.bCSWStatus = g_u8Prevent;
    HSUSBD_MemCopy((uint8_t *)g_u32MassBase, (uint8_t *)&g_sCSW.dCSWSignature, 16);
    MSC_BulkIn(g_u32MassBase, 13);
    g_u8BulkState = BULK_NORMAL;
}

void MSC_ProcessCmd(void)
{
    uint32_t i;
    if (g_u8BulkState == BULK_NORMAL) {
        g_u8BulkState = BULK_OUT;
        MSC_ReceiveCBW(g_u32MassBase);
    }
    if (g_u8BulkState == BULK_CBW) {
        if (*(uint32_t *)(g_u32MassBase) != CBW_SIGNATURE) {
            g_u8BulkState = BULK_NORMAL;
            return;
        }
        for (i = 0; i < 31; i++)
            *((uint8_t *)(&g_sCBW.dCBWSignature) + i) = *(uint8_t *)(g_u32MassBase + i);
        g_sCSW.dCSWTag = g_sCBW.dCBWTag;

        switch (g_sCBW.u8OPCode) {
        case UFI_READ_10:
            g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE;
            MSC_BulkIn(g_u32StorageBase + g_u32LbaAddress, g_sCBW.dCBWDataTransferLength);
            MSC_AckCmd(0);
            break;
        case UFI_WRITE_10:
            g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE;
            MSC_BulkOut(g_u32StorageBase + g_u32LbaAddress, g_sCBW.dCBWDataTransferLength);
            MSC_AckCmd(0);
            break;
        case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
            if (g_sCBW.au8Data[2] & 0x01) {
                g_au8SenseKey[0] = 0x05; g_au8SenseKey[1] = 0x24; g_au8SenseKey[2] = 0x00;
                g_u8Prevent = 1;
            } else {
                g_u8Prevent = 0;
            }
            MSC_AckCmd(0);
            break;
        case UFI_VERIFY_10:
        case UFI_START_STOP:
        case UFI_TEST_UNIT_READY:
            MSC_AckCmd(0);
            break;
        case UFI_REQUEST_SENSE:
            MSC_RequestSense();
            MSC_AckCmd(0);
            break;
        case UFI_READ_FORMAT_CAPACITY:
            MSC_ReadFormatCapacity();
            MSC_AckCmd(0);
            break;
        case UFI_READ_CAPACITY:
            MSC_ReadCapacity();
            MSC_AckCmd(0);
            break;
        case UFI_MODE_SELECT_10:
            MSC_BulkOut(g_u32StorageBase, g_sCBW.dCBWDataTransferLength);
            MSC_AckCmd(0);
            break;
        case UFI_MODE_SENSE_10:
            MSC_ModeSense10();
            MSC_AckCmd(0);
            break;
        case UFI_MODE_SENSE_6:
            MSC_ModeSense6();
            MSC_AckCmd(0);
            break;
        case UFI_INQUIRY:
            HSUSBD_MemCopy((uint8_t *)(g_u32MassBase), (uint8_t *)g_au8InquiryID, 36);
            MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
            MSC_AckCmd(0);
            break;
        default:
            g_au8SenseKey[0] = 0x05; g_au8SenseKey[1] = 0x20; g_au8SenseKey[2] = 0x00;
            if (g_sCBW.dCBWDataTransferLength > 0)
                MSC_AckCmd(g_sCBW.dCBWDataTransferLength);
            else
                MSC_AckCmd(0);
        }
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* HID I2C Command Processing                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

/* HID Report ID: I2C Write */
int32_t HID_CmdI2CWrite(CMD_T *pCmd)
{
    uint8_t slaveAddr = pCmd->u8Data[0] & 0x7F;
    uint8_t len = pCmd->u8Data[1];
    if (len > I2C_MAX_WRITE_LEN) len = I2C_MAX_WRITE_LEN;

    int32_t ret = I2C_Write(slaveAddr, &pCmd->u8Data[2], len);

    pCmd->u8Cmd = HID_CMD_NONE;
    pCmd->u8Data[0] = (ret == 0) ? 0x00 : 0x01;  /* status */
    pCmd->u8Data[1] = len;

    /* Send response via HID IN */
    {
        uint32_t txLen = 2;
        uint32_t i;
        for (i = 0; i < txLen; i++)
            HSUSBD->EP[EPA].EPDAT_BYTE = pCmd->u8Data[i];
        HSUSBD->EP[EPA].EPTXCNT = txLen;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);
    }
    return ret;
}

/* HID Report ID: I2C Read */
int32_t HID_CmdI2CRead(CMD_T *pCmd)
{
    uint8_t slaveAddr = pCmd->u8Data[0] & 0x7F;
    uint8_t len = pCmd->u8Data[1];
    if (len > I2C_MAX_READ_LEN) len = I2C_MAX_READ_LEN;

    uint8_t readData[64];
    int32_t ret = I2C_Read(slaveAddr, readData, len);

    pCmd->u8Cmd = HID_CMD_NONE;
    pCmd->u8Data[0] = (ret == 0) ? 0x00 : 0x01;  /* status */
    pCmd->u8Data[1] = (ret == 0) ? len : 0;

    /* Send response via HID IN */
    {
        uint32_t txLen = 2 + ((ret == 0) ? len : 0);
        uint32_t i;
        for (i = 0; i < txLen && i < 66; i++)
            HSUSBD->EP[EPA].EPDAT_BYTE = pCmd->u8Data[i];
        if (ret == 0 && len > 0)
            for (i = 0; i < len && (i + 2) < 66; i++)
                HSUSBD->EP[EPA].EPDAT_BYTE = readData[i];
        HSUSBD->EP[EPA].EPTXCNT = txLen;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);
    }
    return ret;
}

/* HID Report ID: I2C Write+Read (combined) */
int32_t HID_CmdI2CWriteRead(CMD_T *pCmd)
{
    uint8_t slaveAddr = pCmd->u8Data[0] & 0x7F;
    uint8_t wlen = pCmd->u8Data[1];
    uint8_t rlen = pCmd->u8Data[2];
    if (wlen > I2C_MAX_WRITE_LEN) wlen = I2C_MAX_WRITE_LEN;
    if (rlen > I2C_MAX_READ_LEN) rlen = I2C_MAX_READ_LEN;

    uint8_t readData[64];
    int32_t ret = I2C_WriteRead(slaveAddr, &pCmd->u8Data[3], wlen, readData, rlen);

    pCmd->u8Cmd = HID_CMD_NONE;
    pCmd->u8Data[0] = (ret == 0) ? 0x00 : 0x01;
    pCmd->u8Data[1] = (ret == 0) ? rlen : 0;

    /* Send response via HID IN */
    {
        uint32_t txLen = 2 + ((ret == 0) ? rlen : 0);
        uint32_t i;
        for (i = 0; i < txLen && i < 66; i++)
            HSUSBD->EP[EPA].EPDAT_BYTE = pCmd->u8Data[i];
        if (ret == 0 && rlen > 0)
            for (i = 0; i < rlen && (i + 2) < 66; i++)
                HSUSBD->EP[EPA].EPDAT_BYTE = readData[i];
        HSUSBD->EP[EPA].EPTXCNT = txLen;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);
    }
    return ret;
}

/* HID Report ID: I2C Scan */
int32_t HID_CmdI2CScan(CMD_T *pCmd)
{
    uint8_t results[8] = {0};
    int32_t count = I2C_Scan(results, 8);
    
    pCmd->u8Cmd = HID_CMD_NONE;
    pCmd->u8Data[0] = 0x00;  /* status OK */
    pCmd->u8Data[1] = (uint8_t)count;
    memcpy(&pCmd->u8Data[2], results, count > 8 ? 8 : count);

    /* Send response via HID IN */
    {
        uint32_t txLen = 2 + count;
        uint32_t i;
        for (i = 0; i < txLen && i < 66; i++)
            HSUSBD->EP[EPA].EPDAT_BYTE = pCmd->u8Data[i];
        HSUSBD->EP[EPA].EPTXCNT = txLen;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);
    }
    return 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Process HID command packet from host                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
int32_t ProcessCommand(uint8_t *pu8Buffer, uint32_t u32BufferLen)
{
    uint32_t u32sum;
    CMD_T cmd;

