keroro1768/M487_ScsiTool/firmware/composite/hid_i2c.c
    /* Copy and validate */
    if (u32BufferLen > sizeof(CMD_T)) u32BufferLen = sizeof(CMD_T);
    HSUSBD_MemCopy((uint8_t *)&cmd, pu8Buffer, u32BufferLen);

    /* Check size and signature */
    if ((cmd.u8Size > sizeof(CMD_T)) || (cmd.u8Size > u32BufferLen))
        return -1;
    if (cmd.u32Signature != HID_CMD_SIGNATURE)
        return -1;

    /* Checksum */
    u32sum = CalCheckSum((uint8_t *)&cmd, cmd.u8Size);
    if (u32sum != cmd.u32Checksum)
        return -1;

    /* Save command for async processing */
    gCmd = cmd;

    /* Process command */
    switch (cmd.u8Cmd) {
    case HID_CMD_I2C_WRITE:
        HID_CmdI2CWrite(&gCmd);
        break;
    case HID_CMD_I2C_READ:
        HID_CmdI2CRead(&gCmd);
        break;
    case HID_CMD_I2C_WRITEREAD:
        HID_CmdI2CWriteRead(&gCmd);
        break;
    case HID_CMD_I2C_SCAN:
        HID_CmdI2CScan(&gCmd);
        break;
    default:
        return -1;
    }
    return 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* HID OUT report handler (data from host)                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
void HID_GetOutReport(uint8_t *pu8EpBuf, uint32_t u32Size)
{
    /* Check and process the HID command packet */
    if (ProcessCommand(pu8EpBuf, u32Size)) {
        /* Unknown command - send NAK by doing nothing */
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* HID IN report handler (data to host)                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void HID_SetInReport(void)
{
    /* For HID I2C bridge, responses are sent synchronously in the command handlers.
       This handler is called for EP0 IN (not EPA). No-op for our protocol. */
}

/*---------------------------------------------------------------------------------------------------------*/
/* Checksum calculation                                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t CalCheckSum(uint8_t *buf, uint32_t size)
{
    uint32_t sum = 0;
    uint32_t i;
    for (i = 0; i < size; i++)
        sum += buf[i];
    return sum;
}
